package fancyboard.fonts.keyboard.data

val typeWriter =
    "𝚊𝚋𝚌𝚍𝚎𝚏𝚐𝚑𝚒𝚓𝚔𝚕𝚖𝚗𝚘𝚙𝚚𝚛𝚜𝚝𝚞𝚟𝚠𝚡𝚢𝚣𝙰𝙱𝙲𝙳𝙴𝙵𝙶𝙷𝙸𝙹𝙺𝙻𝙼𝙽𝙾𝙿𝚀𝚁𝚂𝚃𝚄𝚅𝚆𝚇𝚈𝚉𝟷𝟸𝟹𝟺𝟻𝟼𝟽𝟾𝟿𝟶"
val outline =
    "𝕒𝕓𝕔𝕕𝕖𝕗𝕘𝕙𝕚𝕛𝕜𝕝𝕞𝕟𝕠𝕡𝕢𝕣𝕤𝕥𝕦𝕧𝕨𝕩𝕪𝕫𝔸𝔹ℂ𝔻𝔼𝔽𝔾ℍ𝕀𝕁𝕂𝕃𝕄ℕ𝕆ℙℚℝ𝕊𝕋𝕌𝕍𝕎𝕏𝕐ℤ𝟙𝟚𝟛𝟜𝟝𝟞𝟟𝟡𝟘"
val vapourWave = "ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ１２３４５６７９０"
val mirrored = "ɒdɔbɘʇϱ⑁iᒑʞlmnoqpɿƨɟuvwxγzAᗺƆᗡƎꟻວHIᒐꓘ⅃MИOᑫϘЯƧTUVWXYZ123456790"

val sansSerif =
    "𝖺𝖻𝖼𝖽𝖾𝖿𝗀𝗁𝗂𝗃𝗄𝗅𝗆𝗇𝗈𝗉𝗊𝗋𝗌𝗍𝗎𝗏𝗐𝗑𝗒𝗓𝖠𝖡𝖢𝖣𝖤𝖥𝖦𝖧𝖨𝖩𝖪𝖫𝖬𝖭𝖮𝖯𝖰𝖱𝖲𝖳𝖴𝖵𝖶𝖷𝖸𝖹𝟣𝟤𝟥𝟦𝟧𝟨𝟩𝟫𝟢"
val sansSerifItalic =
    "𝘢𝘣𝘤𝘥𝘦𝘧𝘨𝘩𝘪𝘫𝘬𝘭𝘮𝘯𝘰𝘱𝘲𝘳𝘴𝘵𝘶𝘷𝘸𝘹𝘺𝘻𝘈𝘉𝘊𝘋𝘌𝘍𝘎𝘏𝘐𝘑𝘒𝘓𝘔𝘕𝘖𝘗𝘘𝘙𝘚𝘛𝘜𝘝𝘞𝘟𝘠𝘡123456790"
val sansSerifBold =
    "𝗮𝗯𝗰𝗱𝗲𝗳𝗴𝗵𝗶𝗷𝗸𝗹𝗺𝗻𝗼𝗽𝗾𝗿𝘀𝘁𝘂𝘃𝘄𝘅𝘆𝘇𝗔𝗕𝗖𝗗𝗘𝗙𝗚𝗛𝗜𝗝𝗞𝗟𝗠𝗡𝗢𝗣𝗤𝗥𝗦𝗧𝗨𝗩𝗪𝗫𝗬𝗭𝟭𝟮𝟯𝟰𝟱𝟲𝟳𝟵𝟬"
val sansSerifBoldItalic =
    "𝙖𝙗𝙘𝙙𝙚𝙛𝙜𝙝𝙞𝙟𝙠𝙡𝙢𝙣𝙤𝙥𝙦𝙧𝙨𝙩𝙪𝙫𝙬𝙭𝙮𝙯𝘼𝘽𝘾𝘿𝙀𝙁𝙂𝙃𝙄𝙅𝙆𝙇𝙈𝙉𝙊𝙋𝙌𝙍𝙎𝙏𝙐𝙑𝙒𝙓𝙔𝙕123456790"

val serifBold =
    "𝐚𝐛𝐜𝐝𝐞𝐟𝐠𝐡𝐢𝐣𝐤𝐥𝐦𝐧𝐨𝐩𝐪𝐫𝐬𝐭𝐮𝐯𝐰𝐱𝐲𝐳𝐀𝐁𝐂𝐃𝐄𝐅𝐆𝐇𝐈𝐉𝐊𝐋𝐌𝐍𝐎𝐏𝐐𝐑𝐒𝐓𝐔𝐕𝐖𝐗𝐘𝐙𝟏𝟐𝟑𝟒𝟓𝟔𝟕𝟗𝟎"
val serifBoldItalic =
    "𝒂𝒃𝒄𝒅𝒆𝒇𝒈𝒉𝒊𝒋𝒌𝒍𝒎𝒏𝒐𝒑𝒒𝒓𝒔𝒕𝒖𝒗𝒘𝒙𝒚𝒛𝑨𝑩𝑪𝑫𝑬𝑭𝑮𝑯𝑰𝑱𝑲𝑳𝑴𝑵𝑶𝑷𝑸𝑹𝑺𝑻𝑼𝑽𝑾𝑿𝒀𝒁123456790"

val gothic =
    "𝔞𝔟𝔠𝔡𝔢𝔣𝔤𝔥𝔦𝔧𝔨𝔩𝔪𝔫𝔬𝔭𝔮𝔯𝔰𝔱𝔲𝔳𝔴𝔵𝔶𝔷𝔄𝔅ℭ𝔇𝔈𝔉𝔊ℌℑ𝔍𝔎𝔏𝔐𝔑𝔒𝔓𝔔ℜ𝔖𝔗𝔘𝔙𝔚𝔛𝔜ℨ123456790"
val gothicBold =
    "𝖆𝖇𝖈𝖉𝖊𝖋𝖌𝖍𝖎𝖏𝖐𝖑𝖒𝖓𝖔𝖕𝖖𝖗𝖘𝖙𝖚𝖛𝖜𝖝𝖞𝖟𝕬𝕭𝕮𝕯𝕰𝕱𝕲𝕳𝕴𝕵𝕶𝕷𝕸𝕹𝕺𝕻𝕼𝕽𝕾𝕿𝖀𝖁𝖂𝖃𝖄𝖅123456790"
val script =
    "𝒶𝒷𝒸𝒹ℯ𝒻ℊ𝒽𝒾𝒿𝓀𝓁𝓂𝓃ℴ𝓅𝓆𝓇𝓈𝓉𝓊𝓋𝓌𝓍𝓎𝓏𝒜ℬ𝒞𝒟ℰℱ𝒢ℋℐ𝒥𝒦ℒℳ𝒩𝒪𝒫𝒬ℛ𝒮𝒯𝒰𝒱𝒲𝒳𝒴𝒵123456790"
val scriptBold =
    "𝓪𝓫𝓬𝓭𝓮𝓯𝓰𝓱𝓲𝓳𝓴𝓵𝓶𝓷𝓸𝓹𝓺𝓻𝓼𝓽𝓾𝓿𝔀𝔁𝔂𝔃𝓐𝓑𝓒𝓓𝓔𝓕𝓖𝓗𝓘𝓙𝓚𝓛𝓜𝓝𝓞𝓟𝓠𝓡𝓢𝓣𝓤𝓥𝓦𝓧𝓨𝓩123456790"
val circled = "ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ①②③④⑤⑥⑦⑨⓪"
val circledFilled =
    "🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩❶❷❸❹❺❻❼❾⓿"
val squared =
    "🄰🄱🄲🄳🄴🄵🄶🄷🄸🄹🄺🄻🄼🄽🄾🄿🅀🅁🅂🅃🅄🅅🅆🅇🅈🅉🄰🄱🄲🄳🄴🄵🄶🄷🄸🄹🄺🄻🄼🄽🄾🄿🅀🅁🅂🅃🅄🅅🅆🅇🅈🅉123456790"
val squaredFilled =
    "🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉123456790"

val smallCaps = "ᴀʙᴄᴅᴇғɢʜɪᴊᴋʟᴍɴᴏᴘǫʀsᴛᴜᴠᴡxʏᴢABCDEFGHIJKLMNOPQRSTUVWXYZ123456790"

// Need to use script to add the strike/underline
val strikeThrough =
    "𝚊̶𝚋̶𝚌̶𝚍̶𝚎̶𝚏̶𝚐̶𝚑̶𝚒̶𝚓̶𝚔̶𝚕̶𝚖̶𝚗̶𝚘̶𝚙̶𝚚̶𝚛̶𝚜̶𝚝̶𝚞̶𝚟̶𝚠̶𝚡̶𝚢̶𝚣̶𝙰̶𝙱̶𝙲̶𝙳̶𝙴̶𝙵̶𝙶̶𝙷̶𝙸̶𝙹̶𝙺̶𝙻̶𝙼̶𝙽̶𝙾̶𝙿̶𝚀̶𝚁̶𝚂̶𝚃̶𝚄̶𝚅̶𝚆̶𝚇̶𝚈̶𝚉̶𝟷̶𝟸̶𝟹̶𝟺̶𝟻̶𝟼̶𝟽̶𝟿̶𝟶̶"
val slashes =
    "𝚊̷𝚋̷𝚌̷𝚍̷𝚎̷𝚏̷𝚐̷𝚑̷𝚒̷𝚓̷𝚔̷𝚕̷𝚖̷𝚗̷𝚘̷𝚙̷𝚚̷𝚛̷𝚜̷𝚝̷𝚞̷𝚟̷𝚠̷𝚡̷𝚢̷𝚣̷𝙰̷𝙱̷𝙲̷𝙳̷𝙴̷𝙵̷𝙶̷𝙷̷𝙸̷𝙹̷𝙺̷𝙻̷𝙼̷𝙽̷𝙾̷𝙿̷𝚀̷𝚁̷𝚂̷𝚃̷𝚄̷𝚅̷𝚆̷𝚇̷𝚈̷𝚉̷𝟷̷𝟸̷𝟹̷𝟺̷𝟻̷𝟼̷𝟽̷𝟿̷𝟶̷"
val unstyledStrikeThrough =
    "̶a̶b̶c̶d̶e̶f̶g̶h̶i̶j̶k̶l̶m̶n̶o̶p̶q̶r̶s̶t̶u̶v̶w̶x̶y̶z̶A̶B̶C̶D̶E̶F̶G̶H̶I̶J̶K̶L̶M̶N̶O̶P̶Q̶R̶S̶T̶U̶V̶W̶X̶Y̶Z̶1̶2̶3̶4̶5̶6̶7̶9̶0̶"
val underline =
    "𝚊̲𝚋̲𝚌̲𝚍̲𝚎̲𝚏̲𝚐̲𝚑̲𝚒̲𝚓̲𝚔̲𝚕̲𝚖̲𝚗̲𝚘̲𝚙̲𝚚̲𝚛̲𝚜̲𝚝̲𝚞̲𝚟̲𝚠̲𝚡̲𝚢̲𝚣̲𝙰̲𝙱̲𝙲̲𝙳̲𝙴̲𝙵̲𝙶̲𝙷̲𝙸̲𝙹̲𝙺̲𝙻̲𝙼̲𝙽̲𝙾̲𝙿̲𝚀̲𝚁̲𝚂̲𝚃̲𝚄̲𝚅̲𝚆̲𝚇̲𝚈̲𝚉̲𝟷̲𝟸̲𝟹̲𝟺̲𝟻̲𝟼̲𝟽̲𝟿̲𝟶̲"

// Need to implement with script
val doubleUnderline = ""


val superScript = "ᵃᵇᶜᵈᵉᶠᵍʰᶦʲᵏˡᵐⁿᵒᵖᵠʳˢᵗᵘᵛʷˣʸᶻABCDEFGHIJKLMNOPQRSTUVWXYZ¹²³⁴⁵⁶⁷⁹⁰"
val upsideDownString = "ɐqɔpǝɟƃɥᴉɾʞlɯuodbɹsʇnʌʍxʎz"

val normalLayout = arrayOf(
    "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m",
    "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z",
    "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M",
    "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val outlineLayout = arrayOf(
    "𝕒", "𝕓", "𝕔", "𝕕", "𝕖", "𝕗", "𝕘", "𝕙", "𝕚", "𝕛", "𝕜", "𝕝", "𝕞",
    "𝕟", "𝕠", "𝕡", "𝕢", "𝕣", "𝕤", "𝕥", "𝕦", "𝕧", "𝕨", "𝕩", "𝕪", "𝕫",
    "𝔸", "𝔹", "ℂ", "𝔻", "𝔼", "𝔽", "𝔾", "ℍ", "𝕀", "𝕁", "𝕂", "𝕃", "𝕄",
    "ℕ", "𝕆", "ℙ", "ℚ", "ℝ", "𝕊", "𝕋", "𝕌", "𝕍", "𝕎", "𝕏", "𝕐", "ℤ",
    "𝟙", "𝟚", "𝟛", "𝟜", "𝟝", "𝟞", "𝟟", "𝟠", "𝟡", "𝟘"
)

val typeWriterLayout = arrayOf(
    "𝚊", "𝚋", "𝚌", "𝚍", "𝚎", "𝚏", "𝚐", "𝚑", "𝚒", "𝚓", "𝚔", "𝚕", "𝚖",
    "𝚗", "𝚘", "𝚙", "𝚚", "𝚛", "𝚜", "𝚝", "𝚞", "𝚟", "𝚠", "𝚡", "𝚢", "𝚣",
    "𝙰", "𝙱", "𝙲", "𝙳", "𝙴", "𝙵", "𝙶", "𝙷", "𝙸", "𝙹", "𝙺", "𝙻", "𝙼",
    "𝙽", "𝙾", "𝙿", "𝚀", "𝚁", "𝚂", "𝚃", "𝚄", "𝚅", "𝚆", "𝚇", "𝚈", "𝚉",
    "𝟷", "𝟸", "𝟹", "𝟺", "𝟻", "𝟼", "𝟽", "𝟾", "𝟿", "𝟶"
)

val vapourWaveLayout = arrayOf(
    "ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ", "ｋ", "ｌ", "ｍ",
    "ｎ", "ｏ", "ｐ", "ｑ", "ｒ", "ｓ", "ｔ", "ｕ", "ｖ", "ｗ", "ｘ", "ｙ", "ｚ",
    "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ",
    "Ｎ", "Ｏ", "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ",
    "１", "２", "３", "４", "５", "６", "７", "８", "９", "０"
)

val mirroredLayout = arrayOf(
    "ɒ", "d", "ɔ", "b", "ɘ", "ʇ", "ϱ", "⑁", "i", "ᒑ", "ʞ", "l", "m", "n", "o", "q", "p",
    "ɿ", "ƨ", "ɟ", "u", "v", "w", "x", "γ", "z",
    "A", "ᗺ", "Ɔ", "ᗡ", "Ǝ", "ꟻ", "ວ", "H", "I", "ᒐ", "ꓘ", "⅃", "M", "И", "O", "ᑫ", "Ϙ",
    "Я", "Ƨ", "T", "U", "V", "W", "X", "Y", "Z",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val sansSerifLayout = arrayOf(
    "𝖺", "𝖻", "𝖼", "𝖽", "𝖾", "𝖿", "𝗀", "𝗁", "𝗂", "𝗃", "𝗄", "𝗅", "𝗆",
    "𝗇", "𝗈", "𝗉", "𝗊", "𝗋", "𝗌", "𝗍", "𝗎", "𝗏", "𝗐", "𝗑", "𝗒", "𝗓",
    "𝖠", "𝖡", "𝖢", "𝖣", "𝖤", "𝖥", "𝖦", "𝖧", "𝖨", "𝖩", "𝖪", "𝖫", "𝖬",
    "𝖭", "𝖮", "𝖯", "𝖰", "𝖱", "𝖲", "𝖳", "𝖴", "𝖵", "𝖶", "𝖷", "𝖸", "𝖹",
    "𝟣", "𝟤", "𝟥", "𝟦", "𝟧", "𝟨", "𝟩", "𝟪", "𝟫", "𝟢"
)

val sansSerifItalicLayout = arrayOf(
    "𝘢", "𝘣", "𝘤", "𝘥", "𝘦", "𝘧", "𝘨", "𝘩", "𝘪", "𝘫", "𝘬", "𝘭", "𝘮",
    "𝘯", "𝘰", "𝘱", "𝘲", "𝘳", "𝘴", "𝘵", "𝘶", "𝘷", "𝘸", "𝘹", "𝘺", "𝘻",
    "𝘈", "𝘉", "𝘊", "𝘋", "𝘌", "𝘍", "𝘎", "𝘏", "𝘐", "𝘑", "𝘒", "𝘓", "𝘔",
    "𝘕", "𝘖", "𝘗", "𝘘", "𝘙", "𝘚", "𝘛", "𝘜", "𝘝", "𝘞", "𝘟", "𝘠", "𝘡",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val sansSerifBoldLayout = arrayOf(
    "𝗮", "𝗯", "𝗰", "𝗱", "𝗲", "𝗳", "𝗴", "𝗵", "𝗶", "𝗷", "𝗸", "𝗹", "𝗺",
    "𝗻", "𝗼", "𝗽", "𝗾", "𝗿", "𝘀", "𝘁", "𝘂", "𝘃", "𝘄", "𝘅", "𝘆", "𝘇",
    "𝗔", "𝗕", "𝗖", "𝗗", "𝗘", "𝗙", "𝗚", "𝗛", "𝗜", "𝗝", "𝗞", "𝗟", "𝗠",
    "𝗡", "𝗢", "𝗣", "𝗤", "𝗥", "𝗦", "𝗧", "𝗨", "𝗫", "𝗪", "𝗫", "𝗬", "𝗭",
    "𝟭", "𝟮", "𝟯", "𝟰", "𝟱", "𝟲", "𝟳", "8",  "𝟵", "𝟬"
)

val sansSerifBoldItalicLayout = arrayOf(
    "𝙖", "𝙗", "𝙘", "𝙙", "𝙚", "𝙛", "𝙜", "𝙝", "𝙞", "𝙟", "𝙠", "𝙡", "𝙢",
    "𝙣", "𝙤", "𝙥", "𝙦", "𝙧", "𝙨", "𝙩", "𝙪", "𝙫", "𝙬", "𝙭", "𝙮", "𝙯",
    "𝘼", "𝘽", "𝘾", "𝘿", "𝙀", "𝙁", "𝙂", "𝙃", "𝙄", "𝙅", "𝙆", "𝙇", "𝙈",
    "𝙉", "𝙊", "𝙋", "𝙌", "𝙍", "𝙎", "𝙏", "𝙐", "𝙑", "𝙒", "𝙓", "𝙔", "𝙕",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val serifBoldLayout = arrayOf(
    "𝐚", "𝐛", "𝐜", "𝐝", "𝐞", "𝐟", "𝐠", "𝐡", "𝐢", "𝐣", "𝐤", "𝐥", "𝐦",
    "𝐧", "𝐨", "𝐩", "𝐪", "𝐫", "𝐬", "𝐭", "𝐮", "𝐯", "𝐰", "𝐱", "𝐲", "𝐳",
    "𝐀", "𝐁", "𝐂", "𝐃", "𝐄", "𝐅", "𝐆", "𝐇", "𝐈", "𝐉", "𝐊", "𝐋", "𝐌",
    "𝐍", "𝐎", "𝐏", "𝐐", "𝐑", "𝐒", "𝐓", "𝐔", "𝐕", "𝐖", "𝐗", "𝐘", "𝐙",
    "𝟏", "𝟐", "𝟑", "𝟒", "𝟓", "𝟔", "𝟕", "𝟖", "𝟫", "𝟎"
)

val serifBoldItalicLayout = arrayOf(
    "𝒂", "𝒃", "𝒄", "𝒅", "𝒆", "𝒇", "𝒈", "𝒉", "𝒊", "𝒋", "𝒌", "𝒍", "𝒎",
    "𝒏", "𝒐", "𝒑", "𝒒", "𝒓", "𝒔", "𝒕", "𝒖", "𝒗", "𝒘", "𝒙", "𝒚", "𝒛",
    "𝑨", "𝑩", "𝑪", "𝑫", "𝑬", "𝑭", "𝑮", "𝑯", "𝑰", "𝑱", "𝑲", "𝑳", "𝑴",
    "𝑵", "𝑶", "𝑷", "𝑸", "𝑹", "𝑺", "𝑻", "𝑼", "𝑾", "𝑾", "𝑿", "𝑿", "𝒀", "𝒁",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val gothicBoldLayout = arrayOf(
    "𝖆", "𝖇", "𝖈", "𝖉", "𝖊", "𝖋", "𝖌", "𝖍", "𝖎", "𝖏", "𝖐", "𝖑", "𝖒",
    "𝖓", "𝖔", "𝖕", "𝖖", "𝖗", "𝖘", "𝖙", "𝖚", "𝖛", "𝖜", "𝖝", "𝖞", "𝖟",
    "𝕬", "𝕭", "𝕮", "𝕯", "𝕰", "𝕱", "𝕲", "𝕳", "𝕴", "𝕵", "𝕶", "𝕷", "𝕸",
    "𝕹", "𝕺", "𝕻", "𝕼", "𝕽", "𝕾", "𝕿", "𝖀", "𝖁", "𝖂", "𝖃", "𝖄", "𝖅",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val gothicLayout = arrayOf(
    "𝔞", "𝔟", "𝔠", "𝔡", "𝔢", "𝔣", "𝔤", "𝔥", "𝔦", "𝔧", "𝔨", "𝔩", "𝔪",
    "𝔫", "𝔬", "𝔭", "𝔮", "𝔯", "𝔰", "𝔱", "𝔲", "𝔳", "𝔴", "𝔵", "𝔶", "𝔷",
    "𝔄", "𝔅", "ℭ", "𝔇", "𝔈", "𝔉", "𝔊", "ℌ", "ℑ", "𝔍", "𝔎", "𝔏", "𝔐",
    "𝔑", "𝔒", "𝔓", "𝔔", "ℜ", "𝔖", "𝔗", "𝔘", "𝔙", "𝔚", "𝔛", "𝔜", "ℨ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val scriptLayout = arrayOf(
    "𝒶", "𝒷", "𝒸", "𝒹", "ℯ", "𝒻", "𝓰", "𝒽", "𝒾", "𝒿", "𝓀", "𝓁", "𝓂",
    "𝓃", "ℴ", "𝓅", "𝓆", "𝓇", "𝓈", "𝓉", "𝓊", "𝓋", "𝓌", "𝓍", "𝓎", "𝓏",
    "𝒜", "ℬ", "𝒞", "𝒟", "ℰ", "ℱ", "𝒢", "ℋ", "ℐ", "𝒥", "𝒦", "ℒ", "ℳ",
    "𝒩", "𝒪", "𝒫", "𝒬", "ℛ", "𝒮", "𝒯", "𝒰", "𝒱", "𝒲", "𝒳", "𝒴", "𝒵",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val scriptBoldLayout = arrayOf(
    "𝓪", "𝓫", "𝓬", "𝓭", "𝓮", "𝓯", "𝓰", "𝓱", "𝓲", "𝓳", "𝓴", "𝓵", "𝓶",
    "𝓷", "𝓸", "𝓹", "𝓺", "𝓻", "𝓼", "𝓽", "𝓾", "𝓿", "𝔀", "𝔁", "𝔂", "𝔃",
    "𝓐", "𝓑", "𝓒", "𝓓", "𝓔", "𝓕", "𝓖", "𝓗", "𝓘", "𝓙", "𝓚", "𝓛", "𝓜",
    "𝓝", "𝓞", "𝓞", "𝓠", "𝓡", "𝓢", "𝓣", "𝓤", "𝓥", "𝓦", "𝓧", "𝓨", "𝓩",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val circledLayout = arrayOf(
    "ⓐ", "ⓑ", "ⓒ", "ⓓ", "ⓔ", "ⓕ", "ⓖ", "ⓗ", "ⓘ", "ⓙ", "ⓚ", "ⓛ", "ⓜ",
    "ⓝ", "ⓞ", "ⓟ", "ⓠ", "ⓡ", "ⓢ", "ⓣ", "ⓤ", "ⓥ", "ⓦ", "ⓧ", "ⓨ", "ⓩ",
    "Ⓐ", "Ⓑ", "Ⓒ", "Ⓓ", "Ⓔ", "Ⓕ", "Ⓖ", "Ⓗ", "Ⓘ", "Ⓙ", "Ⓚ", "Ⓛ", "Ⓜ",
    "Ⓝ", "Ⓞ", "Ⓟ", "Ⓠ", "Ⓡ", "Ⓢ", "Ⓣ", "Ⓤ", "Ⓥ", "Ⓦ", "Ⓧ", "Ⓨ", "Ⓩ",
    "①", "②", "③", "④", "⑤", "⑥", "⑦", "⑧", "⑨", "⓪"
)

val circledFilledLayout = arrayOf(
    "🅐", "🅑", "🅒", "🅓", "🅔", "🅕", "🅖", "🅗", "🅘", "🅙", "🅚", "🅛", "🅜",
    "🅝", "🅞", "🅟", "🅠", "🅡", "🅢", "🅣", "🅤", "🅥", "🅦", "🅧", "🅨", "🅩",
    "🅐", "🅑", "🅒", "🅓", "🅔", "🅕", "🅖", "🅗", "🅘", "🅙", "🅚", "🅛", "🅜",
    "🅝", "🅞", "🅟", "🅠", "🅡", "🅢", "🅣", "🅤", "🅥", "🅦", "🅧", "🅨", "🅩",
    "❶", "❷", "❸", "❹", "❺", "❻", "❼", "❽", "❾", "⓿"
)

val squaredLayout = arrayOf(
    "🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼",
    "🄽", "🄾", "🄿", "🅀", "🅁", "🅂", "🅃", "🅄", "🅅", "🅆", "🅇", "🅈", "🅉",
    "🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼",
    "🄽", "🄾", "🄿", "🅀", "🅁", "🅂", "🅃", "🅄", "🅅", "🅆", "🅇", "🅈", "🅉",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val squaredFilledLayout = arrayOf(
    "🅰︎", "🅱︎", "🅲︎", "🅳︎", "🅴︎", "🅵︎", "🅶︎", "🅷︎", "🅸︎", "🅹︎", "🅺︎", "🅻︎", "🅼︎",
    "🅽︎", "🅾︎", "🅿︎", "🆀︎", "🆁︎", "🆂︎", "🆃︎", "🆄︎", "🆅︎", "🆆︎", "🆇︎", "🆈︎", "🆉︎",
    "🅰︎", "🅱︎", "🅲︎", "🅳︎", "🅴︎", "🅵︎", "🅶︎", "🅷︎", "🅸︎", "🅹︎", "🅺︎", "🅻︎", "🅼︎",
    "🅽︎", "🅾︎", "🅿︎", "🆀︎", "🆁︎", "🆂︎", "🆃︎", "🆄︎", "🆅︎", "🆆︎", "🆇︎", "🆈︎", "🆉︎",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val smallCapsLayout = arrayOf(
    "ᴀ", "ʙ", "ᴄ", "ᴅ", "ᴇ", "ғ", "ɢ", "ʜ", "ɪ", "ᴊ", "ᴋ", "ʟ", "ᴍ",
    "ɴ", "ᴏ", "ᴘ", "ǫ", "ʀ", "s", "ᴛ", "ᴜ", "ᴠ", "ᴡ", "x", "ʏ", "ᴢ",
    "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M",
    "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val superScriptLayout = arrayOf(
    "ᵃ", "ᵇ", "ᶜ", "ᵈ", "ᵉ", "ᶠ", "ᵍ", "ʰ", "ᶦ", "ʲ", "ᵏ", "ˡ", "ᵐ",
    "ⁿ", "ᵒ", "ᵖ", "ᵠ", "ʳ", "ˢ", "ᵗ", "ᵘ", "ᵛ", "ʷ", "ˣ", "ʸ", "ᶻ",
    "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M",
    "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z",
    "¹", "²", "³", "⁴", "⁵", "⁶", "⁷", "⁸", "⁹", "⁰"
)

val upsideDownLayout = arrayOf(
    "ɐ", "q", "ɔ", "p", "ǝ", "ɟ", "ƃ", "ɥ", "ᴉ", "ɾ", "ʞ", "l", "ɯ",
    "u", "o", "d", "b", "ɹ", "s", "ʇ", "n", "ʌ", "ʍ", "x", "ʎ", "z",
    "ɐ", "q", "ɔ", "p", "ǝ", "ɟ", "ƃ", "ɥ", "ᴉ", "ɾ", "ʞ", "l", "ɯ",
    "u", "o", "d", "b", "ɹ", "s", "ʇ", "n", "ʌ", "ʍ", "x", "ʎ", "z",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val strikeThroughLayout = arrayOf(
    "a̶", "b̶", "c̶", "d̶", "e̶", "f̶", "g̶", "h̶", "i̶", "j̶", "k̶", "l̶", "m̶",
    "n̶", "o̶", "p̶", "q̶", "r̶", "s̶", "t̶", "u̶", "v̶", "w̶", "x̶", "y̶", "z̶",
    "A̶", "B̶", "C̶", "D̶", "E̶", "F̶", "G̶", "H̶", "I̶", "J̶", "K̶", "L̶", "M̶",
    "N̶", "O̶", "P̶", "Q̶", "R̶", "S̶", "T̶", "U̶", "V̶", "W̶", "X̶", "Y̶", "Z̶",
    "1̶", "2̶", "3̶", "4̶", "5̶", "6̶", "7̶", "8̶", "9̶", "0̶"
)

val underlineLayout = arrayOf(
    "a͟", "b͟", "c͟", "d͟", "e͟", "f͟", "g͟", "h͟", "i͟", "j͟", "k͟", "l͟", "m͟",
    "n͟", "o͟", "p͟", "q͟", "r͟", "s͟", "t͟", "u͟", "v͟", "w͟", "x͟", "y͟", "z͟",
    "A͟", "B͟", "C͟", "D͟", "E͟", "F͟", "G͟", "H͟", "I͟", "J͟", "K͟", "L͟", "M͟",
    "N͟", "O͟", "P͟", "Q͟", "R͟", "S͟", "T͟", "U͟", "V͟", "W͟", "X͟", "Y͟", "Z͟",
    "1͟", "2͟", "3͟", "4͟", "5͟", "6͟", "7͟", "8͟", "9͟", "0͟"
)

val slashesLayout = arrayOf(
    "a̷", "b̷", "c̷", "d̷", "e̷", "f̷", "g̷", "h̷", "i̷", "j̷", "k̷", "l̷", "m̷",
    "n̷", "o̷", "p̷", "q̷", "r̷", "s̷", "t̷", "u̷", "v̷", "w̷", "x̷", "y̷", "z̷",
    "A̷", "B̷", "C̷", "D̷", "E̷", "F̷", "G̷", "H̷", "I̷", "J̷", "K̷", "L̷", "M̷",
    "N̷", "O̷", "P̷", "Q̷", "R̷", "S̷", "T̷", "U̷", "V̷", "W̷", "X̷", "Y̷", "Z̷",
    "1̷", "2̷", "3̷", "4̷", "5̷", "6̷", "7̷", "8̷", "9̷", "0̷"
)

val unstyledStrikeThroughLayout = arrayOf(
    "̶a", "̶b", "̶c", "̶d", "̶e", "̶f", "̶g", "̶h", "̶i", "̶j", "̶k", "̶l", "̶m",
    "̶n", "̶o", "̶p", "̶q", "̶r", "̶s", "̶t", "̶u", "̶v", "̶w", "̶x", "̶y", "̶z",
    "̶A", "̶B", "̶C", "̶D", "̶E", "̶F", "̶G", "̶H", "̶I", "̶J", "̶K", "̶L", "̶M",
    "̶N", "̶O", "̶P", "̶Q", "̶R", "̶S", "̶T", "̶U", "̶V", "̶W", "̶X", "̶Y", "̶Z",
    "̶1", "̶2", "̶3", "̶4", "̶5", "̶6", "̶7", "̶8",  "̶9", "̶0"
)

val doubleUnderlineLayout = arrayOf(
    "a̳", "b̳", "c̳", "d̳", "e̳", "f̳", "g̳", "h̳", "i̳", "j̳", "k̳", "l̳", "m̳",
    "n̳", "o̳", "p̳", "q̳", "r̳", "s̳", "t̳", "u̳", "v̳", "w̳", "x̳", "y̳", "z̳",
    "A̳", "B̳", "C̳", "D̳", "E̳", "F̳", "G̳", "H̳", "I̳", "J̳", "K̳", "L̳", "M̳",
    "N̳", "O̳", "P̳", "Q̳", "R̳", "S̳", "T̳", "U̳", "V̳", "W̳", "X̳", "Y̳", "Z̳",
    "1̳", "2̳", "3̳", "4̳", "5̳", "6̳", "7̳", "8̳", "9̳", "0̳"
)

val comicLayout = arrayOf(
    "ᗩ", "ᗷ", "ᑕ", "ᗪ", "ᗴ", "ᖴ", "ᘜ", "ᕼ", "I", "ᒍ", "K", "ᒪ", "ᗰ",
    "ᑎ", "O", "ᑭ", "ᑫ", "ᖇ", "Տ", "T", "ᑌ", "ᐯ", "ᗯ", "᙭", "Y", "ᘔ",
    "ᗩ", "ᗷ", "ᑕ", "ᗪ", "ᗴ", "ᖴ", "ᘜ", "ᕼ", "I", "ᒍ", "K", "ᒪ", "ᗰ",
    "ᑎ", "O", "ᑭ", "ᑫ", "ᖇ", "Տ", "T", "ᑌ", "ᐯ", "ᗯ", "᙭", "Y", "ᘔ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val happyLayout = arrayOf(
    "ă̈", "b̆̈", "c̆̈", "d̆̈", "ĕ̈", "f̆̈", "ğ̈", "h̆̈", "ĭ̈", "j̆̈", "k̆̈", "l̆̈", "m̆̈",
    "n̆̈", "ŏ̈", "p̆̈", "q̆̈", "r̆̈", "s̆̈", "t̆̈", "ŭ̈", "v̆̈", "w̆̈", "x̆̈", "y̆̈", "z̆̈",
    "Ă̈", "B̆̈", "C̆̈", "D̆̈", "Ĕ̈", "F̆̈", "Ğ̈", "H̆̈", "Ĭ̈", "J̆̈", "K̆̈", "L̆̈", "M̆̈",
    "N̆̈", "Ŏ̈", "P̆̈", "Q̆̈", "R̆̈", "S̆̈", "T̆̈", "Ŭ̈", "V̆̈", "W̆̈", "X̆̈", "Y̆̈", "Z̆̈",
    "1̆̈", "2̆̈", "3̆̈", "4̆̈", "5̆̈", "6̆̈", "7̆̈", "8̆̈", "9̆̈", "0̆̈"
)

val sadFaceLayout = arrayOf(
    "ȃ̈", "b̑̈", "c̑̈", "d̑̈", "ȇ̈", "f̑̈", "g̑̈", "h̑̈", "ȋ̈", "j̑̈", "k̑̈", "l̑̈", "m̑̈",
    "n̑̈", "ȏ̈", "p̑̈", "q̑̈", "ȓ̈", "s̑̈", "t̑̈", "ȗ̈", "v̑̈", "w̑̈", "x̑̈", "y̑̈", "z̑̈",
    "Ȃ̈", "B̑̈", "C̑̈", "D̑̈", "Ȇ̈", "F̑̈", "G̑̈", "H̑̈", "Ȋ̈", "J̑̈", "K̑̈", "L̑̈", "M̑̈",
    "N̑̈", "Ȏ̈", "P̑̈", "Q̑̈", "Ȓ̈", "S̑̈", "T̑̈", "Ȗ̈", "V̑̈", "W̑̈", "X̑̈", "Y̑̈", "Z̑̈",
    "1̑̈", "2̑̈", "3̑̈", "4̑̈", "5̑̈", "6̑̈", "7̑̈", "8̑̈", "9̑̈", "0̑̈"
)

val ethiopicLayout = arrayOf(
    "ል", "ጌ", "ር", "ዕ", "ቿ", "ቻ", "ኗ", "ዘ", "ጎ", "ጕ", "ᛕ",  "ረ", "ጠ",
    "ክ", "ዐ", "የ", "ዒ", "ዪ", "ነ", "ፕ", "ሁ", "ሀ", "ሠ", "ሸ", "ሃ", "ጊ",
    "ል", "ጌ", "ር", "ዕ", "ቿ", "ቻ", "ኗ", "ዘ", "ጎ", "ጕ", "ᛕ", "ረ", "ጠ",
    "ክ", "ዐ", "የ", "ዒ", "ዪ", "ነ", "ፕ", "ሁ", "ሀ", "ሠ", "ሸ", "ሃ", "ጊ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)
val bubbles = arrayOf(
    "ḁͦ", "b̥ͦ", "c̥ͦ", "d̥ͦ", "e̥ͦ", "f̥ͦ", "g̥ͦ", "h̥ͦ", "i̥ͦ", "j̥ͦ", "k̥ͦ", "l̥ͦ", "m̥ͦ",
    "n̥ͦ", "o̥ͦ", "p̥ͦ", "q̥ͦ", "r̥ͦ", "s̥ͦ", "t̥ͦ", "u̥ͦ", "v̥ͦ", "w̥ͦ", "x̥ͦ", "y̥ͦ", "z̥ͦ",
    "Ḁͦ", "B̥ͦ", "C̥ͦ", "D̥ͦ", "E̥ͦ", "F̥ͦ", "G̥ͦ", "H̥ͦ", "I̥ͦ", "J̥ͦ", "K̥ͦ", "L̥ͦ", "M̥ͦ",
    "N̥ͦ", "O̥ͦ", "P̥ͦ", "Q̥ͦ", "R̥ͦ", "S̥ͦ", "T̥ͦ", "U̥ͦ", "V̥ͦ", "W̥ͦ", "X̥ͦ", "Y̥ͦ", "Z̥ͦ",
    "1̥ͦ", "2̥ͦ", "3̥ͦ", "4̥ͦ", "5̥ͦ", "6̥ͦ", "7̥ͦ", "8̥ͦ", "9̥ͦ", "0̥ͦ"
)
val chinaLayout = arrayOf(
    "卂", "乃", "匚", "ᗪ", "乇", "千", "ᘜ", "卄", "|", "ﾌ", "Ҝ", "ㄥ", "爪",
    "几", "ㄖ", "卩", "Ҩ", "尺", "丂", "ㄒ", "ㄩ", "ᐯ", "山", "乂", "ㄚ", "乙",
    "卂", "乃", "匚", "ᗪ", "乇", "千", "ᘜ", "卄", "|", "ﾌ", "Ҝ", "ㄥ", "爪",
    "几", "ㄖ", "卩", "Ҩ", "尺", "丂", "ㄒ", "ㄩ", "ᐯ", "山", "乂", "ㄚ", "乙",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val exoticLayout = arrayOf(
    "ꪖ", "᥇", "ᥴ", "ᦔ", "ꫀ", "ᠻ", "ᧁ", "ꫝ", "ﺃ", "꠹", "ᛕ", "ꪶ", "ꪑ",
    "ꪀ", "ꪮ", "ᜣ", "ꪇ", "᥅", "ᦓ", "ꪻ", "ꪊ", "ꪜ", "᭙", "᥊", "ꪗ", "ɀ",
    "ꪖ", "᥇", "ᥴ", "ᦔ", "ꫀ", "ᠻ", "ᧁ", "ꫝ", "ﺃ", "꠹", "ᛕ", "ꪶ", "ꪑ",
    "ꪀ", "ꪮ", "ᜣ", "ꪇ", "᥅", "ᦓ", "ꪻ", "ꪊ", "ꪜ", "᭙", "᥊", "ꪗ", "ɀ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0",
)

val cloudsLayout = arrayOf(
    "a͜͡", "b͜͡", "c͜͡", "d͜͡", "e͜͡", "f͜͡", "g͜͡", "h͜͡", "i͜͡", "j͜͡", "k͜͡", "l͜͡", "m͜͡",
    "n͜͡", "o͜͡", "p͜͡", "q͜͡", "r͜͡", "s͜͡", "t͜͡", "u͜͡", "v͜͡", "w͜͡", "x͜͡", "y͜͡", "z͜͡",
    "A͜͡", "B͜͡", "C͜͡", "D͜͡", "E͜͡", "F͜͡", "G͜͡", "H͜͡", "I͜͡", "J͜͡", "K͜͡", "L͜͡", "M͜͡",
    "N͜͡", "O͜͡", "P͜͡", "Q͜͡", "R͜͡", "S͜͡", "T͜͡", "U͜͡", "V͜͡", "W͜͡", "X͜͡", "Y͜͡", "Z͜͡",
    "1͜͡", "2͜͡", "3͜͡", "4͜͡", "5͜͡", "6͜͡", "7͜͡", "8͜͡", "9͜͡", "0͜͡"
)

val fontusLayout = arrayOf(
    "ꍏ", "ꌃ", "ꏳ", "ꀷ", "ꏂ", "ꎇ", "ꁅ", "ꀍ", "ꀤ", "꒻", "ꀘ", "꒒", "ꎭ",
    "ꈤ", "ꂦ", "ᖘ", "ꆰ", "ꋪ", "ꌚ", "꓄", "ꀎ", "꒦", "ꅐ", "ꉧ", "ꌩ", "ꁴ",
    "ꍏ", "ꌃ", "ꏳ", "ꀷ", "ꏂ", "ꎇ", "ꁅ", "ꀍ", "ꀤ", "꒻", "ꀘ", "꒒", "ꎭ",
    "ꈤ", "ꂦ", "ᖘ", "ꆰ", "ꋪ", "ꌚ", "꓄", "ꀎ", "꒦", "ꅐ", "ꉧ", "ꌩ", "ꁴ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0",
)

val skylineLayout = arrayOf(
    "a̺͆", "b̺͆", "c̺͆", "d̺͆", "e̺͆", "f̺͆", "g̺͆", "h̺͆", "i̺͆", "j̺͆", "k̺͆", "l̺͆", "m̺͆",
    "n̺͆", "o̺͆", "p̺͆", "q̺͆", "r̺͆", "s̺͆", "t̺͆", "u̺͆", "v̺͆", "w̺͆", "x̺͆", "y̺͆", "z̺͆",
    "A̺͆", "B̺͆", "C̺͆", "D̺͆", "E̺͆", "F̺͆", "G̺͆", "H̺͆", "I̺͆", "J̺͆", "K̺͆", "L̺͆", "M̺͆",
    "N̺͆", "O̺͆", "P̺͆", "Q̺͆", "R̺͆", "S̺͆", "T̺͆", "U̺͆", "V̺͆", "W̺͆", "X̺͆", "Y̺͆", "Z̺͆",
    "1̺͆", "2̺͆", "3̺͆", "4̺͆", "5̺͆", "6̺͆", "7̺͆", "8̺͆", "9̺͆", "0̺͆"
)

val arrowLayout = arrayOf(
    "a͎", "b͎", "c͎", "d͎", "e͎", "f͎", "g͎", "h͎", "i͎", "j͎", "k͎", "l͎", "m͎",
    "n͎", "o͎", "p͎", "q͎", "r͎", "s͎", "t͎", "u͎", "v͎", "w͎", "x͎", "y͎", "z͎",
    "A͎", "B͎", "C͎", "D͎", "E͎", "F͎", "G͎", "H͎", "I͎", "J͎", "K͎", "L͎", "M͎",
    "N͎", "O͎", "P͎", "Q͎", "R͎", "S͎", "T͎", "U͎", "V͎", "W͎", "X͎", "Y͎", "Z͎",
    "1͎", "2͎", "3͎", "4͎", "5͎", "6͎", "7͎", "8͎", "9͎", "0͎"
)


val bannedLayout = arrayOf(
    "a⃠", "b⃠", "c⃠", "d⃠", "e⃠", "f⃠", "g⃠", "h⃠", "i⃠", "j⃠", "k⃠", "l⃠", "m⃠",
    "n⃠", "o⃠", "p⃠", "q⃠", "r⃠", "s⃠", "t⃠", "u⃠", "v⃠", "w⃠", "x⃠", "y⃠", "z⃠",
    "A⃠", "B⃠", "C⃠", "D⃠", "E⃠", "F⃠", "G⃠", "H⃠", "I⃠", "J⃠", "K⃠", "L⃠", "M⃠",
    "N⃠", "O⃠", "P⃠", "Q⃠", "R⃠", "S⃠", "T⃠", "U⃠", "V⃠", "W⃠", "X⃠", "Y⃠", "Z⃠",
    "1⃠", "2⃠", "3⃠", "4⃠", "5⃠", "6⃠", "7⃠", "8⃠", "9⃠", "0⃠"
)

val stinkyLayout = arrayOf(
    "a̾", "b̾", "c̾", "d̾", "e̾", "f̾", "g̾", "h̾", "i̾", "j̾", "k̾", "l̾", "m̾",
    "n̾", "o̾", "p̾", "q̾", "r̾", "s̾", "t̾", "u̾", "v̾", "w̾", "x̾", "y̾", "z̾",
    "A̾", "B̾", "C̾", "D̾", "E̾", "F̾", "G̾", "H̾", "I̾", "J̾", "K̾", "L̾", "M̾",
    "N̾", "O̾", "P̾", "Q̾", "R̾", "S̾", "T̾", "U̾", "V̾", "W̾", "X̾", "Y̾", "Z̾",
    "1̾", "2̾", "3̾", "4̾", "5̾", "6̾", "7̾", "8̾", "9̾", "0̾"
)

val grassHopper = arrayOf(
    "მ", "ზ", "ე", "ძ", "პ", "f", "ც", "h", "í", "ʝ", "κ", "l", "ო",
    "ղ", "ѻ", "ρ", "გ", "Γ", "ჰ", "ŧ", "υ", "v", "w", "ჯ", "ყ", "ɀ",
    "მ", "ზ", "ე", "ძ", "პ", "f", "ც", "h", "í", "ʝ", "κ", "l", "ო",
    "ղ", "ѻ", "ρ", "გ", "Γ", "ჰ", "ŧ", "υ", "v", "w", "ჯ", "ყ", "ɀ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val oldItalic = arrayOf(
    "𐌀", "𐌁", "𐌂", "𐌃", "𐌄", "𐌅", "ɠ", "𐋅", "𐌉", "ɉ", "𐌊", "𐌋", "𐌌",
    "𐌍", "ꝋ", "𐌐", "𐌒", "ɽ", "𐌔", "𐌕", "𐌵", "ʋ", "ꮤ", "𐋄", "𐌙", "ɀ",
    "𐌀", "𐌁", "𐌂", "𐌃", "𐌄", "𐌅", "Ɠ", "𐋅", "𐌉", "Ɉ", "𐌊", "𐌋", "𐌌",
    "𐌍", "Ꝋ", "𐌐", "𐌒", "Ɽ", "𐌔", "𐌕", "𐌵", "Ʋ", "Ꮤ", "𐋄", "𐌙", "Ɀ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val wavy = arrayOf(
    "ᗩ", "ᙖ", "ᙅ", "ᗫ", "ᙓ", "ᖴ", "ᘜ", "ᕼ", "ᓰ", "ᒍ", "K", "ᒪ", "ᙏ",
    "ᑎ", "O", "ᕵ", "ᕴ", "ᖇ", "S", "ᖶ", "ᙀ", "ᐯ", "ᙎ", "᙭", "ᖻ", "ᘔ",
    "ᗩ", "ᙖ", "ᙅ", "ᗫ", "ᙓ", "ᖴ", "ᘜ", "ᕼ", "ᓰ", "ᒍ", "K", "ᒪ", "ᙏ",
    "ᑎ", "O", "ᕵ", "ᕴ", "ᖇ", "S", "ᖶ", "ᙀ", "ᐯ", "ᙎ", "᙭", "ᖻ", "ᘔ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val digitalThai = arrayOf(
    "ค", "๒", "ƈ", "๔", "ę", "ᵮ", "ʛ", "ħ", "เ", "ʝ", "ƙ", "ɭ", "๓",
    "ภ", "๏", "ƥ", "ɋ", "ᴦ", "ร", "ŧ", "ย", "ש", "ฬ", "א", "ץ", "ƶ",
    "ค", "๒", "ƈ", "๔", "ę", "ᵮ", "ʛ", "ħ", "เ", "ʝ", "ƙ", "ɭ", "๓",
    "ภ", "๏", "ƥ", "ɋ", "ᴦ", "ร", "ŧ", "ย", "ש", "ฬ", "א", "ץ", "ƶ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val modernLatin = arrayOf(
    "ƛ", "Ɓ", "Ƈ", "Ɗ", "Є", "Ƒ", "Ɠ", "Ӈ", "Ɩ", "ʆ", "Ҡ", "Լ", "M",
    "Ɲ", "Ơ", "Ƥ", "Ƣ", "Ʀ", "Ƨ", "Ƭ", "Ʋ", "ᐯ", "Ɯ", "Ҳ", "Ꭹ", "Ȥ",
    "ƛ", "Ɓ", "Ƈ", "Ɗ", "Є", "Ƒ", "Ɠ", "Ӈ", "Ɩ", "ʆ", "Ҡ", "Լ", "M",
    "Ɲ", "Ơ", "Ƥ", "Ƣ", "Ʀ", "Ƨ", "Ƭ", "Ʋ", "ᐯ", "Ɯ", "Ҳ", "Ꭹ", "Ȥ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val scripty = arrayOf(
    "ᥲ", "b", "ᥴ", "d", "ᥱ", "f", "g", "h", "ι", "j", "k", "ᥣ", "m",
    "ᥒ", "o", "ρ", "q", "r", "s", "t", "υ", "v", "w", "x", "ყ", "z",
    "ᥲ", "b", "ᥴ", "d", "ᥱ", "f", "g", "h", "ι", "j", "k", "ᥣ", "m",
    "ᥒ", "o", "ρ", "q", "r", "s", "t", "υ", "v", "w", "x", "ყ", "z",
    "𝟷", "𝟸", "𝟹", "𝟺", "𝟻", "𝟼", "𝟽", "𝟾", "𝟿", "𝟶"
)

val stylizedAlpha = arrayOf(
    "⍺", "ɓ", "ƈ", "ɗ", "ⱸ", "ʆ", "ɠ", "ɦ", "ί", "ʝ", "ƙ", "ȴ", "ɱ",
    "ȵ", "ơ", "ƥ", "ʠ", "ɽ", "᥉", "ȶ", "᭘", "꣗", "᭙", "᥊", "ƴ", "ʑ",
    "⍺", "ɓ", "ƈ", "ɗ", "ⱸ", "ʆ", "ɠ", "ɦ", "ί", "ʝ", "ƙ", "ȴ", "ɱ",
    "ȵ", "ơ", "ƥ", "ʠ", "ɽ", "᥉", "ȶ", "᭘", "꣗", "᭙", "᥊", "ƴ", "ʑ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val copticStyle = arrayOf(
    "ⲇ", "ⲃ", "ⲥ", "𝖽", "ⲉ", "f", "ⳋ", "ⲏ", "ⳕ", "ⳗ", "қ", "ⳑ", "ϻ",
    "ⲛ", "ⲟ", "ⳏ", "ⳝ", "ⲅ", "⳽", "τυ", "ⳳ", "ⲱ", "ⲭ", "ⲩ", "ⲹ",
    "ⲇ", "ⲃ", "ⲥ", "𝖽", "ⲉ", "f", "ⳋ", "ⲏ", "ⳕ", "ⳗ", "қ", "ⳑ", "ϻ",
    "ⲛ", "ⲟ", "ⳏ", "ⳝ", "ⲅ", "⳽", "τυ", "ⳳ", "ⲱ", "ⲭ", "ⲩ", "ⲹ",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "0"
)

val layoutMap = mapOf<String, Array<String>>(
    "Normal" to normalLayout,
    "𝚃𝚢𝚙𝚎𝚠𝚛𝚒𝚝𝚎𝚛" to typeWriterLayout,
    "𝕆𝕦𝕥𝕝𝕚𝕟𝕖" to outlineLayout,
    "ᑕOᗰIᑕ" to comicLayout,
    "𝔊𝔬𝔱𝔥𝔦𝔠" to gothicLayout,
    "𝕲𝖔𝖙𝖍𝖎𝖈 𝕭𝖔𝖑𝖉" to gothicBoldLayout,
    "ꎇꂦꈤ꓄ꀎꌚ" to fontusLayout,
    "乇ㄒ卄丨ㄖ卩丨匚" to ethiopicLayout,
    "𝒮𝒸𝓇𝒾𝓅𝓉" to scriptLayout,
    "𝓢𝓬𝓻𝓲𝓹𝓽 𝓑𝓸𝓵𝓭" to scriptBoldLayout,
    "匚卄丨几卂" to chinaLayout,
    "ꫀᥴꪮꪻﺃᥴ" to exoticLayout,
    "ᙎᗩᐯᖻ" to wavy,
    "๔เgเtคl  tħคเ" to digitalThai,
    "MƠƊЄƦƝ ԼƛƬƖƝ" to modernLatin,
    "sᥴrιρtყ" to scripty,
    "᥉ȶƴȴίʑⱸɗ ⍺ȴƥɦ⍺" to stylizedAlpha,
    "Ｖａｐｏｕｒｗａｖｅ" to vapourWaveLayout,
    "Sans Serif" to sansSerifLayout,
    "𝘚𝘢𝘯𝘴 𝘚𝘦𝘳𝘪𝘧 𝘐𝘵𝘢𝘭𝘪𝘤" to sansSerifItalicLayout,
    "𝗦𝗮𝗻𝘀 𝗦𝗲𝗿𝗶𝗳 𝗕𝗼𝗹𝗱" to sansSerifBoldLayout,
    "𝙎𝙖𝙣𝙨 𝙎𝙚𝙧𝙞𝙛 𝘽𝙤𝙡𝙙 𝙄𝙩𝙖𝙡𝙞𝙘" to sansSerifBoldItalicLayout,
    "𝐒𝐞𝐫𝐢𝐟 𝐁𝐨𝐥𝐝" to serifBoldLayout,
    "𝑺𝒆𝒓𝒊𝒇 𝑩𝒐𝒍𝒅 𝑰𝒕𝒂𝒍𝒊𝒄" to serifBoldItalicLayout,
    "ⲥⲟⳏⲧіⲥ" to copticStyle,
    "𐌏𐌋𐌃  𐌉𐌕𐌀𐌋𐌉𐌂" to oldItalic,
    "ცΓმჰჰhѻρρΓ" to grassHopper,
    "Ⓒⓘⓡⓒⓛⓔⓓ" to circledLayout,
    "🅒︎🅘︎🅡︎🅒︎🅛︎🅔︎🅢︎" to circledFilledLayout,
    "B⃠a⃠n⃠n⃠e⃠d⃠" to bannedLayout,
    "🅂🅀🅄🄰🅁🄴🅂" to squaredLayout,
    "🆂︎🆀︎🆄︎🅰︎🆁︎🅴︎🆂︎" to squaredFilledLayout,
    "Sᴍᴀʟʟ Cᴀᴘs" to smallCapsLayout,
    "U̲n̲d̲e̲r̲l̲i̲n̲e̲" to underlineLayout,
    "D̳o̳u̳b̳l̳e̳ U̳n̳d̳e̳r̳l̳i̳n̳e̳" to doubleUnderlineLayout,
    "S̶t̶r̶i̶k̶e̶" to strikeThroughLayout,
    "S̷l̷a̷s̷h̷e̷s̷" to slashesLayout,
    "ˢᵘᵖᵉʳˢᶜʳᶦᵖᵗ" to superScriptLayout,
    "uʍop ǝpᴉsdn" to upsideDownLayout,
    "H̆̈ă̈p̆̈p̆̈y̆̈" to happyLayout,
    "S̑̈ȃ̈d̑̈" to sadFaceLayout,
    "B̥ͦu̥ͦb̥ͦb̥ͦl̥ͦe̥ͦs̥ͦ" to bubbles,
    "a͎r͎r͎o͎w͎" to arrowLayout,
    "C͜͡l͜͡o͜͡u͜͡d͜͡s͜͡" to cloudsLayout,
    "S͆k͆y͆l͆i͆n͆e͆" to skylineLayout,
    "s̾t̾i̾n̾k̾y̾" to stinkyLayout,
)

val allFontString: Array<String> = layoutMap.values
    .flatMap { it.asList() }
    .distinct()
    .sorted()
    .toTypedArray()

val fontNames = layoutMap.keys.toTypedArray()