package fancyboard.fonts.keyboard.data

private val animals = "𓃥 𓃠 𓃰 𓃱 𓃯 𓃭 𓃸 𓃵 𓃗 𓃘 𓃙 𓃟 𓄀 𓄁 𓄂 𓄃 𓃚 𓃛 𓃜 𓃝 𓃞 𓃒 𓃓 𓃔 𓃕 𓃖 𓃡 𓃢 𓃦 𓃩 𓃫 𓃬 𓃮 𓃲 𓃴 𓃶 𓃷 𓃹 𓃻 𓃽 𓃾 𓃿 𓄄 𓄅 𓄆 𓄇 𓆇 𓆈 𓆉 𓆌 𓆏 𓆗 𓆘 𓆙 𓆚 𓆐 𓆑 𓆒 𓆓 𓆔 𓆕 𓆖 𓆊 𓆍 𓆣 𓆤 𓆥 𓆦 𓆧 𓆨 𓆛 𓆜 𓆝 𓆞 𓆟 𓆠 𓆡 𓆢 𓄿 𓅀 𓅁 𓅂 𓅃 𓅄 𓅅 𓅆 𓅇 𓅈 𓅉 𓅊 𓅋 𓅌 𓅍 𓅎 𓅏 𓅐 𓅑 𓅒 𓅓 𓅔 𓅕 𓅖 𓅗 𓅘 𓅙 𓅚 𓅛 𓅜 𓅝 𓅞 𓅟 𓅠 𓅢 𓅣 𓅤 𓅥 𓅦 𓅧 𓅨 𓅩 𓅪 𓅫 𓅬 𓅭 𓅮 𓅯 𓅰 𓅱 𓅲 𓅳 𓅴 𓅵 𓅷 𓅶 𓅸 𓅹 𓅺 𓅻 𓅼 𓅽 𓅾 𓅿 𓆀 𓆁 𓆂 𓆃 𓆆"
val heart = arrayOf(
    "♡", "♥︎", "❤︎", "ᥫ᭡", "-`♡´-", "ᢉ𐭩", "ꨄ", "𓆩❤︎𓆪",
    "❀", "☘\uFE0E", "❥", "♡ྀི", "♡ ̆̈", "𓇼", "𓆉", "𓆝",
    "𓆡", "❦", "୧୨", "✧˖", "❣\uFE0E", "✿", "ৎ୭", "☾\uFE0E",
    "☽\uFE0E", "ʚɞ", "<𝟑", "ꕤ", "ఌ", "🝮", "㋛", "ツ", "シ"
)
val stars = arrayOf(
    "★", "☆", "⭑", "✮", "\uD81A\uDD10", "✶", "✰", "𖦹",
    "☁︎", "✦", "✪", "༄", "⛈\uFE0E", "☀\uFE0E", "𖤓", "☂\uFE0E",
    "ᨒ", "⟡", "✧", "ོ", "𖧧", "⛆", "☕\uFE0E", "❆",
    "✵", "𖣘", "᯾", "𑁍", "❄︎", "✫", "᪥"
)
val tools = arrayOf(
    "☕\uFE0E", "☎\uFE0E", "✈\uFE0E", "⌚\uFE0E", "⌛\uFE0E", "⌨\uFE0E", "✉\uFE0E", "✏\uFE0E",
    "✂\uFE0E", "✒\uFE0E", "✇\uFE0E", "⚙\uFE0E", "⚖\uFE0E", "⚓\uFE0E", "⛵\uFE0E", "⛽\uFE0E",
    "⛺\uFE0E", "⛲\uFE0E", "⛏\uFE0E", "⚒\uFE0E", "⚔\uFE0E", "⚗\uFE0E", "⚕\uFE0E", "⚖\uFE0E",
    "☂\uFE0E", "☁\uFE0E", "☀\uFE0E", "☃\uFE0E", "⚖\uFE0E", "☄\uFE0E", "☠\uFE0E", "☢\uFE0E",
    "☣\uFE0E", "⚛\uFE0E", "⚰\uFE0E", "⚱\uFE0E", "☤\uFE0E"
)

val extra = arrayOf(
    "✌\uFE0E", "☝\uFE0E", "☞\uFE0E", "☟\uFE0E", "☜\uFE0E", "✍\uFE0E",
    "♠\uFE0E", "♥\uFE0E", "♦\uFE0E", "♣\uFE0E", "🂱", "🂲", "🂳", "🂴", "🂵", "🂶",
    "☯\uFE0E", "ॐ", "♲\uFE0E", "⚠\uFE0E", "⚛\uFE0E", "☢\uFE0E", "☣\uFE0E", "⚕\uFE0E", "☒\uFE0E",
    "☠\uFE0E", "✞\uFE0E", "✡\uFE0E", "☬\uFE0E", "⟁\uFE0E", "☌\uFE0E", "➪\uFE0E", "➤\uFE0E",
    "𖤍\uFE0E", "𓇽\uFE0E", "𒊹\uFE0E", "𖠌\uFE0E", "ꕥ\uFE0E"
)

val faceCreate = "( ) ಥ ಥʘ ʘԾ Ծ ʕ ʕº ͡° ͡° ͡ಠ ͡ಠᴖ ᴖ ͠° °◕ ◕ ◉ ◯ ⊙ ʘ ಥ_ಥ ◔ ◑ ◐ ◒ ⚆ ⚈ ⚉ ⚇ \uD80C\uDC7F \uD80C\uDC80 \uD80C\uDCE0 \uD80C\uDC79 \uD80C\uDC00"

val allSymbols = mapOf<String, Array<String>>(
    "❤︎ꨄ㋛" to heart,

    "𓃥𓃠𓃰" to animals.split(" ").toTypedArray(),
    "☆☁︎❄︎" to stars,
    "☎\uFE0E✈\uFE0E✂\uFE0E" to tools,
    "♠\uFE0E☯\uFE0E☞\uFE0E" to extra,
    "͡°◕͠°" to faceCreate.split(" ").toTypedArray(),
)

val allSymbolCategories = allSymbols.keys.toTypedArray()